fonecmid-diplom/src/Enums/ВКМ_СтатусыОчереди/ВКМ_СтатусыОчереди.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_СтатусыОчереди</name>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ВКМ_ОчередьОтправки/ВКМ_ОчередьОтправки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ОчередьОтправки</name>
  <attributes>
    <name>ДокументСсылка</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияЗадачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВКМ_СтатусыОчереди</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_Телеграм/Module.bsl
#Область ПрограммныйИнтерфейс

// Отправляет уведомление в телеграм
// Параметры:
//  ТекстУведомления - Строка - текст уведомления
Процедура ТелеграмУведомление(ТекстУведомления) Экспорт

	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);

	ДанныеДляЗапроса = "bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);

	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_УведомлениеТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомлениеТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомлениеТелеграмБоту КАК ВКМ_УведомлениеТелеграмБоту";

	Выборка = Запрос.Выполнить().Выбрать();

	ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

	Пока Выборка.Следующий() Цикл

		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", ИдентификаторГруппыДляОповещения);
		Сообщение.Вставить("text", ТекстУведомления + " " + Выборка.ТекстСообщения);

		СтрокаJSON = СтрокаJSON(Сообщение);

		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);

		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);

		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();

			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтрокаJSON(ОбъектJSON)

	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);

	Возврат Запись.Закрыть();

КонецФункции


// Процедура выполняет отправку сообщений в телеграм.
Процедура ВКМ_ОбработатьОчередьОтправки() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОчередьОтправки.Ссылка КАК Ссылка,
	|	ВКМ_ОчередьОтправки.ДокументСсылка КАК ДокументСсылка,
	|	ВКМ_ОчередьОтправки.ДокументСсылка.ОписаниеПроблемы КАК ОписаниеПроблемы
	|ИЗ
	|	Справочник.ВКМ_ОчередьОтправки КАК ВКМ_ОчередьОтправки
	|ГДЕ
	|	ВКМ_ОчередьОтправки.Статус = ЗНАЧЕНИЕ(Перечисление.ВКМ_СтатусыОчереди.КОтправке)";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();

		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", ИдентификаторГруппыДляОповещения);
		Сообщение.Вставить("text", Выборка.ОписаниеПроблемы);

		HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);

		ДанныеДляЗапроса = "bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
		HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);

		СтрокаJSON = СтрокаJSON(Сообщение);

		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);

		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);

		Если Ответ.КодСостояния = 200 Тогда
			Статус = Перечисления.ВКМ_СтатусыОчереди.Отправлено;
		Иначе
			Статус = Перечисления.ВКМ_СтатусыОчереди.КОтправке;
		КонецЕсли;

		Очередь = Выборка.Ссылка.ПолучитьОбъект();
		Очередь.Статус = Статус;
		Очередь.Записать();

	КонецЦикла;
КонецПроцедуры
#КонецОбласти
